def get_item_names():
    return {
        "머리어깨": "빛을 잃은 진실",
        "상의": "탐험가의 노련한 코트",
        "하의": "상상을 담은 엔지니어 팬츠",
        "벨트": "파괴된 신념",
        "신발": "소망을 향한 움직임",
        "목걸이": "아토믹 코어 네클레스",
        "팔찌": "흑화의 구속 팔찌",
        "반지": "핏빛의 결정 반지",
        "보조장비": "옵티컬 컴뱃 글래스",
        "마법석": "평화를 위한 투쟁",
        "귀걸이": "눈물이 스민 보석"
    }

def get_item_names_weapon():
    return {
        "소검": "내딛은 자의 소검",
        "도": "내딛은 자의 도",
        "둔기" : "내딛은 자의 둔기",
        "대검" : "내딛은 자의 대검",
        "광검" : "내딛은 자의 광검",
        "너클" : "내딛은 자의 너클",
        "통파" : "내딛은 자의 통파",
        "클로" : "내딛은 자의 클로",
        "건틀릿" : "내딛은 자의 건틀릿",
        "권투글러브" : "내딛은 자의 권투글러브",
        "자동권총" : "내딛은 자의 자동권총",
        "보우건" : "내딛은 자의 보우건",
        "리볼버" : "내딛은 자의 리볼버",
        "머스켓" : "내딛은 자의 머스켓",
        "핸드캐넌" : "내딛은 자의 핸드캐넌",
        "로드" : "내딛은 자의 로드",
        "스탭" : "내딛은 자의 스탭",
        "봉" : "내딛은 자의 봉",
        "창" : "내딛은 자의 창",
        "빗자루" : "내딛은 자의 빗자루",
        "십자가" : "내딛은 자의 십자가",
        "염주" : "내딛은 자의 염주",
        "토템" : "내딛은 자의 토템",
        "배틀 액스" : "내딛은 자의 배틀 액스",
        "낫" : "내딛은 자의 낫",
        "단검" : "내딛은 자의 단검",
        "쌍검" : "내딛은 자의 쌍검",
        "완드" : "내딛은 자의 완드",
        "차크라 웨펀" : "내딛은 자의 차크라 웨펀",
        "장창" : "내딛은 자의 장창",
        "미늘창" : "내딛은 자의 미늘창",
        "광창" : "내딛은 자의 광창",
        "투창" : "내딛은 자의 투창",
        "장도" : "내딛은 자의 장도",
        "소태도" : "내딛은 자의 소태도",
        "중검" : "내딛은 자의 중검",
        "코어블레이드" : "내딛은 자의 코어블레이드"
    }
# 무기는 종류 넘 많은데 ㅠㅠ 후에 추가하기

# itemStatus - 장비 아이템 수치 정보
# itemGradeName - 아이템 등급명
# itemGradeValue - 아이템 등급 수치 (1~100%)
# itemStatus - 장비 아이템 수치 정보

# itemStatus -> [name] : 물리 방어력 / 힘 / 체력 / 지능 / 정신력 / 버프력 
