def get_item_names():
    return {
        "머리어깨": "빛을 잃은 진실",
        "상의": "탐험가의 노련한 코트",
        "하의": "상상을 담은 엔지니어 팬츠",
        "벨트": "파괴된 신념",
        "신발": "소망을 향한 움직임",
        "목걸이": "아토믹 코어 네클레스",
        "팔찌": "흑화의 구속 팔찌",
        "반지": "핏빛의 결정 반지",
        "보조장비": "옵티컬 컴뱃 글래스",
        "마법석": "평화를 위한 투쟁",
        "귀걸이": "눈물이 스민 보석"
    }

# 무기는 종류 넘 많은데 ㅠㅠ 후에 추가하기

# itemStatus - 장비 아이템 수치 정보
# itemGradeName - 아이템 등급명
# itemGradeValue - 아이템 등급 수치 (1~100%)
# itemStatus - 장비 아이템 수치 정보

# itemStatus -> [name] : 물리 방어력 / 힘 / 체력 / 지능 / 정신력 / 버프력 
