# 카드 목록
card_info = {
    "딜러": {
        "무기": {
            "멸절의 폭룡왕 바칼 카드": {
                "물리/마법/독립 공격력": "+30",
                "모든 속성 강화": "+15"
            }
        },

        "머리어깨": {
            "검은 공포의 아스타로스 카드" : {
                "최종 데미지": "+2%",
                "힘/지능/체력/정신력": "+40",
                "물리/마법/독립 공격력": "+10",
                "물리/마법 크리티컬 히트": "+5%"
            },
            "사라 웨인 카드": {
                "최종 데미지": "+2%",
                "힘/지능/체력/정신력": "+40",
                "물리/마법/독립 공격력": "+10",
                "물리/마법 크리티컬 히트": "+5%"
            }
        },

        "상의": {
            "1대대 대장 무적자 유진 카드" : {
                "물리/마법/독립 공격력": "+110",
                "힘/지능": "+80"
            }
        },

        "하의": {
            "불신위괴 라르고 카드" : {
                "물리/마법/독립 공격력": "+110",
                "힘/지능": "+80"
            }
        },

        "벨트": {
            "사무치는 냉룡 스카사 카드" : {
                "최종 데미지": "+2%",
                "힘/지능/체력/정신력": "+40",
                "물리/마법/독립 공격력": "+10",
                "물리/마법 크리티컬 히트": "+3%"
            }
           
        },

        "신발": {
            "요기를 머금은 요무무 카드" : {
                "최종 데미지": "+2%",
                "힘/지능/체력/정신력": "+40",
                "물리/마법/독립 공격력": "+10",
                "물리/마법 크리티컬 히트": "+3%"
          }
        },

        "목걸이&팔찌": {
            "심연을 걷는 자 카드" : {
                "수 속성 강화": "+35",
                "암 속성 강화": "+35"
            },

            "GB-4 디리겐트 카드" : {
                "화 속성 강화": "+35",
                "수 속성 강화": "+35"
            },

            "GB-1 햅스 카드" : {
                "명 속성 강화": "+35",
                "암 속성 강화": "+35"
            },

            "퀸 디스트로이어 카드" : {
                "화 속성 강화": "+35",
                "명 속성 강화": "+35"
            },

            "불안정한 균열 카드" : {
                "모든 속성 강화": "+33"
            }
        },

        "반지": {
            "숲의 전언자 카밀라 카드" : {
                "최종 데미지": "+1%",
                "모든 속성 강화": "+33"
            }
        },

        "보조장비": {
            "시브의 보조장비 보주" : {
                "공격력 증폭": "+3%",
                "물리/마법 크리티컬 히트": "+3%",
                "모든 속성 강화": "+12"
            },

            "아홉 꼬리 블로나 카드" : {
                "공격력 증폭": "+3%",
                "물리/마법 크리티컬 히트": "+3%",
                "모든 속성 강화": "+12"
            }
        },

        "마법석": {
            "큰 어른 루톤 카드" : {
                "모든 속성 강화": "+35"
            }
        },

        "귀걸이": {
            "불의 숨결을 내는 자 카드" : {
                "힘/지능/체력/정신력": "+70",
                "모든 속성 강화": "+15"
            }
        }
    },

    "버퍼": {
         "무기": {
            "뒤쫓는 자 제논 카드": {
                "힘/지능/체력/정신력": "+110",
                "캐스트 속도": "+7%",

                "(버퍼 싱글 플레이 변경 옵션)\n물리/마법/독립 공격력": "+30",
                "모든 속성 강화": "+15"
            }
        },

        "머리어깨": {
            "코드네임 게이볼그 카드" : {
                "힘/지능/체력/정신력": "+100",
                "퍼페티어 LV": "+3",
                "수호의 은총 LV": "+3",
                "계시 : 아리아 LV": "+3",
                "센세이션 LV": "+3",

                "(버퍼 싱글 플레이 변경 옵션)\n물리/마법/독립 공격력": "+10",
                "힘/지능/체력/정신력": "+40",
                "물리/마법 크리티컬 히트": "+5%",
                "최종 데미지": "+2%"
            }
        },

        "상의": {
            "블루호크 선장 버디 카드" : {
                "힘/지능/체력/정신력": "+100",
                "퍼페티어 LV": "+3",
                "수호의 은총 LV": "+3",
                "계시 : 아리아 LV": "+3",
                "센세이션 LV": "+3",

                "(버퍼 싱글 플레이 변경 옵션)\n물리/마법/독립 공격력": "+110",
                "힘/지능/체력/정신력": "+80",
            }
        },

        "하의": {
            "안개의 감시자 브림 카드" : {
                "힘/지능/체력/정신력": "+100",
                "퍼페티어 LV": "+3",
                "수호의 은총 LV": "+3",
                "계시 : 아리아 LV": "+3",
                "센세이션 LV": "+3",

                "(버퍼 싱글 플레이 변경 옵션)\n물리/마법/독립 공격력": "+110",
                "힘/지능/체력/정신력": "+80",
            }
        },

        "벨트": {
            "부패하는 사룡 스피라찌 카드" : {
                "힘/지능/체력/정신력": "+100",
                "물리/마법 크리티컬 히트": "+7%",
                "소악마 LV": "+2",
                "신념의 오라 LV": "+2",
                "신실한 열정 LV": "+2",
                "유명세 LV": "+2",
            }
           
        },

        "신발": {
            "안개의 사제 클리디스 카드" : {
                "힘/지능/체력/정신력": "+100",
                "퍼페티어 LV": "+3",
                "수호의 은총 LV": "+3",
                "계시 : 아리아 LV": "+3",
                "센세이션 LV": "+3",

                "(버퍼 싱글 플레이 변경 옵션)\n물리/마법/독립 공격력": "+110",
                "힘/지능/체력/정신력": "+40",
                "물리/마법 크리티컬 히트": "+3%",
                "최종 데미지": "+2%"
          }
        },

        "목걸이&팔찌": {
            "금룡 느마우그 카드" : {
                "힘/지능/체력/정신력": "+90",
                "(버퍼 싱글 플레이 변경 옵션)\n모든 속성 강화": "+35"
            }
        },

        "반지": {
            "빛나는 다이앤 카드" : {
                "힘/지능/체력/정신력": "+100",
                "퍼페티어 LV": "+1",
                "수호의 은총 LV": "+1",
                "계시 : 아리아 LV": "+1",
                "센세이션 LV": "+1",

                "(버퍼 싱글 플레이 변경 옵션)\n모든 속성 강화": "+35",
                "최종 데미지": "+1%"
            }
        },

        "보조장비": {
            "기억의 도서관지기 카드" : {
                "힘/지능/체력/정신력": "+100",
                "퍼페티어 LV": "+3",
                "수호의 은총 LV": "+3",
                "계시 : 아리아 LV": "+3",
                "센세이션 LV": "+3",

                "(버퍼 싱글 플레이 변경 옵션)\n모든 속성 강화": "+12",
                "물리/마법 크리티컬 히트": "+3%",
                "공격력 증폭": "+3%"
            }
        },

        "마법석": {
            "흰 구름 감시자 라르고 카드" : {
                "힘/지능/체력/정신력": "+100",
                "퍼페티어 LV": "+3",
                "수호의 은총 LV": "+3",
                "계시 : 아리아 LV": "+3",
                "센세이션 LV": "+3",

                "(버퍼 싱글 플레이 변경 옵션)\n모든 속성 강화": "+35",
            }
        },

        "귀걸이": {
            "연합 사령관 이리네 카드" : {
                "힘/지능/체력/정신력": "+200",

                "(버퍼 싱글 플레이 변경 옵션)\n힘/지능/체력/정신력": "+70",
                "모든 속성 강화": "+35"
            }
        }
    }
}

# 카드 정보를 반환
def get_card_info(job_type: str) -> dict:
    if job_type in card_info:
        return card_info[job_type]
    else:
        return None